export const errorCode = [
  1,
  400,
  401,
  403,
  404,
  405,
  500,
  40000, // 参数为空或非法
  40001, // 添加失败
  40002, // 更新失败
  40003, // 删除失败
  40004, // 操作失败
  40005, // 数据已存在
  40006, // 密码错误
  40007, // 用户被锁定或者删除
  40008, // 限制重复提交
  40009, // 数据不存在
  40010, // 两次输入不一样
  40011, // 验证码错误
  40012, // 无效的用户ID
  40013, // 无效的会话ID
  40014, // token无效
  40015, // 不合法的文件类型
  40016, // 不合法的文件大小
  40017, // 不合法的部门ID
  40018, // 不合法的请求格式
  40019, // 不合法的URL长度
  40020, // url中包含不合法domain
  40021, // 不合法的分页大小
  43001, // 需要GET请求
  43002, // 需要POST请求
  43003, // 需要HTTPS
  43004, // 无效的HTTP HEADER Content-Type
  43005, // 需要授权
  43006, // 参数需要multipart类型
  45002, // 数据内容超过限制
  45003, // 数据内容不允许修改
  91100, // 非法操作
  91101, // token签名与本地计算签名不匹配
  91102, // token过期
  99900, // 系统异常
  99990, // 未知异常
  -1, // 系统繁忙
];

export const gatewayErrorCode = {
  "1001": "请求令牌AuthToken过期",
  "1003": "鉴权UserToken过期",
  "1002": "鉴权AppToken过期",
  "1004": "鉴权UserUpToken过期",
  "8001": "应用登录应用简称或密码为空",
  "8002": "用户登录AuthToken为空",
  "8003": "校检AppToken为空",
  "8004": "校检UserToken为空",
  "8005": "更新UserToken为空",
  "9001": "应用登录应用简称或密码错误",
  "9002": "用户登录用户账号密码错误",
  "9003": "请求接口超出授权范围",
};
